[stash_thewatchv2_notable_events]
TRUNCATE                = 0
# only look for ***SPLUNK*** on the first line
HEADER_MODE             = firstline
# we can summary index past data, but rarely future data
MAX_DAYS_HENCE          = 2
MAX_DAYS_AGO            = 10000
# 5 years difference between two events
MAX_DIFF_SECS_AGO       = 155520000
MAX_DIFF_SECS_HENCE     = 155520000
TIME_PREFIX             = (?m)^\*{3}Common\sAction\sModel\*{3}.*$
MAX_TIMESTAMP_LOOKAHEAD = 25
LEARN_MODEL             = false
# break .stash_new custom format into events
SHOULD_LINEMERGE        = false
BREAK_ONLY_BEFORE_DATE  = false
LINE_BREAKER            = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n)

TRANSFORMS-0parse_cam_header    = orig_action_name_for_stash_cam,orig_sid_for_stash_cam,orig_rid_for_stash_cam,sourcetype_for_stash_cam
TRANSFORMS-1sinkhole_cam_header = sinkhole_cam_header

description = A custom sourcetype for The Watch logs

# Field alias for multivalued fields name
FIELDALIAS-thewatch_artifact = orig_thewatch_artifact{} AS thewatch_artifact
FIELDALIAS-thewatch_artifact_id = orig_thewatch_artifact_id{} AS thewatch_artifact_id
FIELDALIAS-thewatch_artifact_case_id = orig_thewatch_artifact_case_id{} AS thewatch_artifact_case_id
FIELDALIAS-thewatch_artifact_tag_id = orig_thewatch_artifact_tag_id{} AS thewatch_artifact_tag_id
#FIELDALIAS-thewatch_case_severity_levels_id = orig_thewatch_case_severity_levels_id{} AS thewatch_case_severity_levels_id
FIELDALIAS-thewatch_artifact_matched_fields = orig_thewatch_artifact_matched_fields{} AS thewatch_artifact_match_fields
FIELDALIAS-thewatch_artifact_matched_keys = orig_thewatch_artifact_matched_keys{} AS thewatch_artifact_match_keys
EVAL-thewatch_artifact_action = case(action IN ("Accept","Allow","Allowed","success"),"allowed",action IN ("inprogress"),"pending",action IN ("Drop","Prevent","Blocked"),"blocked",isnotnull(action),action,1=1,"Unknown")
# Every DATABASE lookup is used to load data from lookups using the id
LOOKUP-THEWATCH_DATABASE_cases = thewatch_cases id AS thewatch_artifact_case_id OUTPUTNEW name AS thewatch_case_name, aggregation AS thewatch_case_aggregation
LOOKUP-THEWATCH_DATABASE_tags = thewatch_tags id AS thewatch_artifact_tag_id OUTPUTNEW name AS thewatch_tag_name type AS thewatch_tag_type default_score_new_qualification AS thewatch_tag_default_score_new_qualification set_id AS thewatch_tag_set_id
LOOKUP-THEWATCH_DATABASE_severity_levels = thewatch_severity_levels id as thewatch_case_severity_levels_id OUTPUTNEW name as thewatch_case_severity_levels_name
LOOKUP-THEWATCH_DATABASE_artifact_file_name = thewatch_admin_artifact_file_name id as thewatch_artifact_file_name_id OUTPUTNEW description as thewatch_artifact_file_name_description confidence_level as thewatch_artifact_file_name_confidence_level status as thewatch_artifact_file_name_status
LOOKUP-THEWATCH_DATABASE_artifact_hash = thewatch_admin_artifact_hash id as thewatch_artifact_hash_id OUTPUTNEW description as thewatch_artifact_hash_description confidence_level as thewatch_artifact_hash_confidence_level status as thewatch_artifact_hash_status
LOOKUP-THEWATCH_DATABASE_artifact_ip = thewatch_admin_artifact_ip id as thewatch_artifact_ip_id OUTPUTNEW description as thewatch_artifact_ip_description confidence_level as thewatch_artifact_ip_confidence_level status as thewatch_artifact_ip_status
LOOKUP-THEWATCH_DATABASE_artifact_mail = thewatch_admin_artifact_mail id as thewatch_artifact_mail_id OUTPUTNEW description as thewatch_artifact_mail_description confidence_level as thewatch_artifact_mail_confidence_level status as thewatch_artifact_mail_status
LOOKUP-THEWATCH_DATABASE_artifact_event_id_ad = thewatch_admin_artifact_event_id_ad id as thewatch_artifact_event_id_id OUTPUTNEW description as thewatch_artifact_event_id_description confidence_level as thewatch_artifact_event_id_confidence_level status as thewatch_artifact_event_id_status
LOOKUP-THEWATCH_DATABASE_artifact_sourcetype = thewatch_admin_artifact_sourcetype id as thewatch_artifact_sourcetype_id OUTPUTNEW description as thewatch_artifact_sourcetype_description confidence_level as thewatch_artifact_sourcetype_confidence_level status as thewatch_artifact_sourcetype_status
LOOKUP-THEWATCH_DATABASE_artifact_url = thewatch_admin_artifact_url id as thewatch_artifact_url_id OUTPUTNEW description as thewatch_artifact_url_description confidence_level as thewatch_artifact_url_confidence_level status as thewatch_artifact_url_status
LOOKUP-THEWATCH_DATABASE_artifact_user = thewatch_admin_artifact_user id as thewatch_artifact_user_id OUTPUTNEW description as thewatch_artifact_user_description confidence_level as thewatch_artifact_user_confidence_level status as thewatch_artifact_user_status
LOOKUP-THEWATCH_DATABASE_artifact_workstation = thewatch_admin_artifact_workstation id as thewatch_artifact_workstation_id OUTPUTNEW description as thewatch_artifact_workstation_description confidence_level as thewatch_artifact_workstation_confidence_level status as thewatch_artifact_workstation_status
# We add information concerning enrichment database
# We fields are chosen from : https://docs.splunk.com/Documentation/CIM/4.19.0/User/CIMfields
## DEST_IP
LOOKUP-THEWATCH_ENRICHMENT_dest_ip = thewatch_enrichment_ip value as dest_ip OUTPUTNEW source as tw_enrichment_source_dest_ip type as tw_enrichment_type_dest_ip description as tw_enrichment_description_dest_ip score as tw_enrichment_score_dest_ip
LOOKUP-THEWATCH_ENRICHMENT_dest_translated_ip = thewatch_enrichment_ip value as dest_translated_ip OUTPUTNEW source as tw_enrichment_source_dest_ip type as tw_enrichment_type_dest_ip description as tw_enrichment_description_dest_ip score as tw_enrichment_score_dest_ip
## IP
LOOKUP-THEWATCH_ENRICHMENT_dvc_ip = thewatch_enrichment_ip value as dvc_ip OUTPUTNEW source as tw_enrichment_source_ip type as tw_enrichment_type_ip description as tw_enrichment_description_ip score as tw_enrichment_score_ip
LOOKUP-THEWATCH_ENRICHMENT_ip = thewatch_enrichment_ip value as ip OUTPUTNEW source as tw_enrichment_source_ip type as tw_enrichment_type_ip description as tw_enrichment_description_ip score as tw_enrichment_score_ip
## SRC_IP
LOOKUP-THEWATCH_ENRICHMENT_src_ip = thewatch_enrichment_ip value as src_ip OUTPUTNEW source as tw_enrichment_source_src_ip type as tw_enrichment_type_src_ip description as tw_enrichment_description_src_ip score as tw_enrichment_score_src_ip
LOOKUP-THEWATCH_ENRICHMENT_src_translated_ip = thewatch_enrichment_ip value as src_ip OUTPUTNEW source as tw_enrichment_source_src_ip type as tw_enrichment_type_src_ip description as tw_enrichment_description_src_ip score as tw_enrichment_score_src_ip
## USER
LOOKUP-THEWATCH_ENRICHMENT_src_user = thewatch_enrichment_user value as src_user OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user
LOOKUP-THEWATCH_ENRICHMENT_src_user_name = thewatch_enrichment_user value as src_user_name OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user
LOOKUP-THEWATCH_ENRICHMENT_src_user_id = thewatch_enrichment_user value as src_user_id OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user
LOOKUP-THEWATCH_ENRICHMENT_user = thewatch_enrichment_user value as user OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user
LOOKUP-THEWATCH_ENRICHMENT_user_id = thewatch_enrichment_user value as user_id OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user
LOOKUP-THEWATCH_ENRICHMENT_user_name = thewatch_enrichment_user value as user_name OUTPUTNEW source as tw_enrichment_source_user type as tw_enrichment_type_user description as tw_enrichment_description_user score as tw_enrichment_score_user

[source::...the_watch_v2_create_notable_events_modalert.log*]
sourcetype = taakthewatchv2:log
###################################################################
###################################################################
# The Watch - Core (automatic lookups that will help us to find artifacts)
###################################################################
###################################################################

[default]
# EVAL statements
EVAL-original_sourcetype = coalesce(orig_sourcetype,sourcetype)
# LOOKUP statements (based on the CIM model)
## SOURCETYPE
LOOKUP-THEWATCH_ARTIFACT_sourcetype = thewatch_artifact_sourcetype artifact AS sourcetype OUTPUTNEW id AS thewatch_artifact_sourcetype_id status AS thewatch_artifact_sourcetype_status artifact AS thewatch_artifact_sourcetype tlp AS thewatch_artifact_sourcetype_tlp case_id AS thewatch_artifact_sourcetype_case_id
## IP
LOOKUP-THEWATCH_ARTIFACT_ip_src = thewatch_artifact_ip artifact AS src OUTPUTNEW id AS thewatch_artifact_ip_id status AS thewatch_artifact_ip_status artifact AS thewatch_artifact_ip tlp AS thewatch_artifact_ip_tlp case_id AS thewatch_artifact_ip_case_id
LOOKUP-THEWATCH_ARTIFACT_ip_src_ip = thewatch_artifact_ip artifact AS src_ip OUTPUTNEW id AS thewatch_artifact_ip_id status AS thewatch_artifact_ip_status artifact AS thewatch_artifact_ip tlp AS thewatch_artifact_ip_tlp case_id AS thewatch_artifact_ip_case_id
LOOKUP-THEWATCH_ARTIFACT_ip_dest = thewatch_artifact_ip artifact AS dest OUTPUTNEW id AS thewatch_artifact_ip_id status AS thewatch_artifact_ip_status artifact AS thewatch_artifact_ip tlp AS thewatch_artifact_ip_tlp case_id AS thewatch_artifact_ip_case_id
LOOKUP-THEWATCH_ARTIFACT_ip_dest_ip = thewatch_artifact_ip artifact AS dest_ip OUTPUTNEW id AS thewatch_artifact_ip_id status AS thewatch_artifact_ip_status artifact AS thewatch_artifact_ip tlp AS thewatch_artifact_ip_tlp case_id AS thewatch_artifact_ip_case_id
## MAC (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_dest_mac = thewatch_artifact_mac artifact AS dest_mac OUTPUTNEW id AS thewatch_artifact_mac_id status AS thewatch_artifact_mac_status artifact AS thewatch_artifact_mac tlp AS thewatch_artifact_mac_tlp case_id AS thewatch_artifact_mac_case_id
## Signatures (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_signature = thewatch_artifact_signature artifact AS signature OUTPUTNEW id AS thewatch_artifact_signature_id status AS thewatch_artifact_signature_status artifact AS thewatch_artifact_signature tlp AS thewatch_artifact_signature_tlp case_id AS thewatch_artifact_signature_case_id
## Categories (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_category = thewatch_artifact_category artifact AS category OUTPUTNEW id AS thewatch_artifact_category_id status AS thewatch_artifact_category_status artifact AS thewatch_artifact_category tlp AS thewatch_artifact_category_tlp case_id AS thewatch_artifact_category_case_id
#LOOKUP-THEWATCH_ARTIFACT_object_category = thewatch_artifact_category artifact AS object_category OUTPUTNEW id AS thewatch_artifact_object_category_id status AS thewatch_artifact_object_category_status artifact AS thewatch_artifact_object_category tlp AS thewatch_artifact_category_tlp case_id AS thewatch_artifact_object_category_case_id
## Event ID
LOOKUP-THEWATCH_ARTIFACT_event_id_signature_id = thewatch_artifact_event_id_ad artifact AS signature_id OUTPUTNEW id AS thewatch_artifact_event_id_id status AS thewatch_artifact_event_id_status artifact AS thewatch_artifact_event_id tlp AS thewatch_artifact_event_id_tlp case_id AS thewatch_artifact_event_id_case_id
## File name
LOOKUP-THEWATCH_ARTIFACT_file_name_file_name = thewatch_artifact_file_name artifact AS file_name OUTPUTNEW id AS thewatch_artifact_file_name_id status AS thewatch_artifact_file_name_status artifact AS thewatch_artifact_file_name tlp AS thewatch_artifact_file_name_tlp case_id AS thewatch_artifact_file_name_case_id
LOOKUP-THEWATCH_ARTIFACT_file_name_original_file_name = thewatch_artifact_file_name artifact AS original_file_name OUTPUTNEW id AS thewatch_artifact_file_name_id status AS thewatch_artifact_file_name_status artifact AS thewatch_artifact_file_name tlp AS thewatch_artifact_file_name_tlp case_id AS thewatch_artifact_file_name_case_id
## Path (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_file_path = thewatch_artifact_path artifact AS file_path OUTPUTNEW id AS thewatch_artifact_path_id status AS thewatch_artifact_path_status artifact AS thewatch_artifact_path tlp AS thewatch_artifact_path_tlp case_id AS thewatch_artifact_path_case_id
##LOOKUP-THEWATCH_ARTIFACT_object_path = thewatch_artifact_path artifact AS object_path OUTPUTNEW id AS thewatch_artifact_path_id status AS thewatch_artifact_path_status artifact AS thewatch_artifact_path case_id AS thewatch_artifact_path_case_id
## User
LOOKUP-THEWATCH_ARTIFACT_user_user = thewatch_artifact_user artifact AS user OUTPUTNEW id AS thewatch_artifact_user_id status AS thewatch_artifact_user_status artifact AS thewatch_artifact_user tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_user_case_id
LOOKUP-THEWATCH_ARTIFACT_user_src_user = thewatch_artifact_user artifact AS src_user OUTPUTNEW id AS thewatch_artifact_user_id status AS thewatch_artifact_user_status artifact AS thewatch_artifact_user tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_user_case_id
## Emails
LOOKUP-THEWATCH_ARTIFACT_email_sender = thewatch_artifact_mail artifact AS sender OUTPUTNEW id AS thewatch_artifact_mail_id status AS thewatch_artifact_mail_status artifact AS thewatch_artifact_mail tlp AS thewatch_artifact_mail_tlp case_id AS thewatch_artifact_mail_case_id
LOOKUP-THEWATCH_ARTIFACT_email_recipient = thewatch_artifact_mail artifact AS recipient OUTPUTNEW id AS thewatch_artifact_mail_id status AS thewatch_artifact_mail_status artifact AS thewatch_artifact_mail tlp AS thewatch_artifact_mail_tlp case_id AS thewatch_artifact_mail_case_id
LOOKUP-THEWATCH_ARTIFACT_email_orig_recipient = thewatch_artifact_mail artifact AS orig_recipient OUTPUTNEW id AS thewatch_artifact_mail_id status AS thewatch_artifact_mail_status artifact AS thewatch_artifact_mail tlp AS thewatch_artifact_mail_tlp case_id AS thewatch_artifact_mail_case_id
## Queries (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_query = thewatch_artifact_query artifact AS query OUTPUTNEW id AS thewatch_artifact_query_id status AS thewatch_artifact_query_status artifact AS thewatch_artifact_query tlp AS thewatch_artifact_query_tlp case_id AS thewatch_artifact_query_case_id
## Apps (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_app = thewatch_artifact_app artifact AS app OUTPUTNEW id AS thewatch_artifact_app_id status AS thewatch_artifact_app_status artifact AS thewatch_artifact_app tlp AS thewatch_artifact_app_tlp case_id AS thewatch_artifact_app_case_id
## User Agent (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_http_user_agent = thewatch_artifact_user_agent artifact AS http_user_agent OUTPUTNEW id AS thewatch_artifact_user_agent_id status AS thewatch_artifact_user_agent_status artifact AS thewatch_artifact_user_agent tlp AS thewatch_artifact_user_agent_tlp case_id AS thewatch_artifact_user_agent_case_id
#LOOKUP-THEWATCH_ARTIFACT_user_agent = thewatch_artifact_user_agent artifact AS user_agent OUTPUTNEW id AS thewatch_artifact_user_agent_id status AS thewatch_artifact_user_agent_status artifact AS thewatch_artifact_user_agent tlp AS thewatch_artifact_user_agent_tlp case_id AS thewatch_artifact_user_agent_case_id
## URLs/Domains
LOOKUP-THEWATCH_ARTIFACT_url_url = thewatch_artifact_url artifact AS url OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_dest_nt_domain = thewatch_artifact_url artifact AS dest_nt_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_src_nt_domain = thewatch_artifact_url artifact AS src_nt_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_recipient_domain = thewatch_artifact_url artifact AS recipient_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_src_user_domain = thewatch_artifact_url artifact AS src_user_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_dest_dns = thewatch_artifact_url artifact AS dest_dns OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_dest_nt_dns = thewatch_artifact_url artifact AS dest_nt_dns OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_http_referrer = thewatch_artifact_url artifact AS http_referrer OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_http_referrer_domain = thewatch_artifact_url artifact AS http_referrer_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
LOOKUP-THEWATCH_ARTIFACT_url_url_domain = thewatch_artifact_url artifact AS url_domain OUTPUTNEW id AS thewatch_artifact_url_id status AS thewatch_artifact_url_status artifact AS thewatch_artifact_url tlp AS thewatch_artifact_user_tlp case_id AS thewatch_artifact_url_case_id
## Hashes
LOOKUP-THEWATCH_ARTIFACT_hash_ssl_hash = thewatch_artifact_hash artifact AS ssl_hash OUTPUTNEW id AS thewatch_artifact_hash_id status AS thewatch_artifact_hash_status artifact AS thewatch_artifact_hash case_id AS thewatch_artifact_hash_case_id
LOOKUP-THEWATCH_ARTIFACT_hash_file_hash = thewatch_artifact_hash artifact AS file_hash OUTPUTNEW id AS thewatch_artifact_hash_id status AS thewatch_artifact_hash_status artifact AS thewatch_artifact_hash case_id AS thewatch_artifact_hash_case_id
## Ports (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_src_port = thewatch_artifact_port artifact AS src_port OUTPUTNEW id AS thewatch_artifact_port_id status AS thewatch_artifact_port_status artifact AS thewatch_artifact_port tlp AS thewatch_artifact_port_tlp case_id AS thewatch_artifact_port_case_id
#LOOKUP-THEWATCH_ARTIFACT_dest_port = thewatch_artifact_port artifact AS dest_port OUTPUTNEW id AS thewatch_artifact_port_id status AS thewatch_artifact_port_status artifact AS thewatch_artifact_port tlp AS thewatch_artifact_port_tlp case_id AS thewatch_artifact_port_case_id
## CVE (not supported yet as type)
#LOOKUP-THEWATCH_ARTIFACT_cve = thewatch_artifact_cve artifact AS cve OUTPUTNEW id AS thewatch_artifact_cve_id status AS thewatch_artifact_cve_status artifact AS thewatch_artifact_cve tlp AS thewatch_artifact_cve_tlp case_id AS thewatch_artifact_cve_case_id
## Workstations
LOOKUP-THEWATCH_ARTIFACT_workstation_src = thewatch_artifact_workstation artifact AS src OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id
LOOKUP-THEWATCH_ARTIFACT_workstation_src_dns = thewatch_artifact_workstation artifact AS src_dns OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id
LOOKUP-THEWATCH_ARTIFACT_workstation_dest = thewatch_artifact_workstation artifact AS dest OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id
LOOKUP-THEWATCH_ARTIFACT_workstation_dest_dns = thewatch_artifact_workstation artifact AS dest_dns OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id
LOOKUP-THEWATCH_ARTIFACT_workstation_host = thewatch_artifact_workstation artifact AS host OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id
LOOKUP-THEWATCH_ARTIFACT_workstation_hostname = thewatch_artifact_workstation artifact AS hostname OUTPUTNEW id AS thewatch_artifact_workstation_id status AS thewatch_artifact_workstation_status artifact AS thewatch_artifact_workstation tlp AS thewatch_artifact_workstation_tlp case_id AS thewatch_artifact_workstation_case_id

